# -*- coding: utf-8 -*-
"""
Created on Wed Sep  4 00:14:35 2024

@author: Диана
"""

# Запит рядка у користувача
s = input("Введіть рядок: ")

# Перевірка, чи достатня довжина рядка для виконання операції
while len(s) < 4:  # Для зрізу потрібні принаймні 4 символи
    s = input("Рядок занадто короткий для виконання зрізу. Введіть рядок, довжина якого становить принаймні 4 символи: ")

# Виконання зрізу після введення рядка достатньої довжини
result = s[1:-1]
print("Результат зрізу:", result)

